of60/tutorials/rheoFoam/Aneurysm/HerschelBulkley/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type            HerschelBulkley;
                
                rho             rho   [1 -3 0 0 0 0 0] 1050;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 0.15; 
   		tau0            tau0  [ 1 -1 -2 0 0 0 0 ] .0175; 
   		k               k     [ 1 -1 -1 0 0 0 0 ] 8.9721e-3; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.8601; 
   		
   		PapanastasiouRegularization false;
               
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
