of60/tutorials/rheoFoam/Aneurysm/HerschelBulkley/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        FDIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }

    U
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.001;
        minIter           0;
        maxIter           1000;
    }
 
}

PostProcessing
{
  functions
   (
     WSSmag
      {
        funcType           calcWSS;
        
        isTwoPhaseFlow           false;
        includePolymericStresses false; // Only in case of viscoelastic model

        enabled            true;
        evaluateInterval   1;       
      }
   );
}

 

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
         
    }
}

relaxationFactors
{
     fields
      {        
        p 0.9;
      }

     equations
      { 
        U 1;
      }
}

// ************************************************************************* //
